// Generated by jextract

package whisper.ffi;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct whisper_full_params {
 *     enum whisper_sampling_strategy strategy;
 *     int n_threads;
 *     int n_max_text_ctx;
 *     int offset_ms;
 *     int duration_ms;
 *     bool translate;
 *     bool no_context;
 *     bool no_timestamps;
 *     bool single_segment;
 *     bool print_special;
 *     bool print_progress;
 *     bool print_realtime;
 *     bool print_timestamps;
 *     bool token_timestamps;
 *     float thold_pt;
 *     float thold_ptsum;
 *     int max_len;
 *     bool split_on_word;
 *     int max_tokens;
 *     bool debug_mode;
 *     int audio_ctx;
 *     bool tdrz_enable;
 *     const char *suppress_regex;
 *     const char *initial_prompt;
 *     bool carry_initial_prompt;
 *     const whisper_token *prompt_tokens;
 *     int prompt_n_tokens;
 *     const char *language;
 *     bool detect_language;
 *     bool suppress_blank;
 *     bool suppress_nst;
 *     float temperature;
 *     float max_initial_ts;
 *     float length_penalty;
 *     float temperature_inc;
 *     float entropy_thold;
 *     float logprob_thold;
 *     float no_speech_thold;
 *     struct {
 *         int best_of;
 *     } greedy;
 *     struct {
 *         int beam_size;
 *         float patience;
 *     } beam_search;
 *     whisper_new_segment_callback new_segment_callback;
 *     void *new_segment_callback_user_data;
 *     whisper_progress_callback progress_callback;
 *     void *progress_callback_user_data;
 *     whisper_encoder_begin_callback encoder_begin_callback;
 *     void *encoder_begin_callback_user_data;
 *     ggml_abort_callback abort_callback;
 *     void *abort_callback_user_data;
 *     whisper_logits_filter_callback logits_filter_callback;
 *     void *logits_filter_callback_user_data;
 *     const whisper_grammar_element **grammar_rules;
 *     size_t n_grammar_rules;
 *     size_t i_start_rule;
 *     float grammar_penalty;
 *     bool vad;
 *     const char *vad_model_path;
 *     whisper_vad_params vad_params;
 * }
 * }
 */
public class whisper_full_params {

    whisper_full_params() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        whisper_h.C_INT.withName("strategy"),
        whisper_h.C_INT.withName("n_threads"),
        whisper_h.C_INT.withName("n_max_text_ctx"),
        whisper_h.C_INT.withName("offset_ms"),
        whisper_h.C_INT.withName("duration_ms"),
        whisper_h.C_BOOL.withName("translate"),
        whisper_h.C_BOOL.withName("no_context"),
        whisper_h.C_BOOL.withName("no_timestamps"),
        whisper_h.C_BOOL.withName("single_segment"),
        whisper_h.C_BOOL.withName("print_special"),
        whisper_h.C_BOOL.withName("print_progress"),
        whisper_h.C_BOOL.withName("print_realtime"),
        whisper_h.C_BOOL.withName("print_timestamps"),
        whisper_h.C_BOOL.withName("token_timestamps"),
        MemoryLayout.paddingLayout(3),
        whisper_h.C_FLOAT.withName("thold_pt"),
        whisper_h.C_FLOAT.withName("thold_ptsum"),
        whisper_h.C_INT.withName("max_len"),
        whisper_h.C_BOOL.withName("split_on_word"),
        MemoryLayout.paddingLayout(3),
        whisper_h.C_INT.withName("max_tokens"),
        whisper_h.C_BOOL.withName("debug_mode"),
        MemoryLayout.paddingLayout(3),
        whisper_h.C_INT.withName("audio_ctx"),
        whisper_h.C_BOOL.withName("tdrz_enable"),
        MemoryLayout.paddingLayout(3),
        whisper_h.C_POINTER.withName("suppress_regex"),
        whisper_h.C_POINTER.withName("initial_prompt"),
        whisper_h.C_BOOL.withName("carry_initial_prompt"),
        MemoryLayout.paddingLayout(7),
        whisper_h.C_POINTER.withName("prompt_tokens"),
        whisper_h.C_INT.withName("prompt_n_tokens"),
        MemoryLayout.paddingLayout(4),
        whisper_h.C_POINTER.withName("language"),
        whisper_h.C_BOOL.withName("detect_language"),
        whisper_h.C_BOOL.withName("suppress_blank"),
        whisper_h.C_BOOL.withName("suppress_nst"),
        MemoryLayout.paddingLayout(1),
        whisper_h.C_FLOAT.withName("temperature"),
        whisper_h.C_FLOAT.withName("max_initial_ts"),
        whisper_h.C_FLOAT.withName("length_penalty"),
        whisper_h.C_FLOAT.withName("temperature_inc"),
        whisper_h.C_FLOAT.withName("entropy_thold"),
        whisper_h.C_FLOAT.withName("logprob_thold"),
        whisper_h.C_FLOAT.withName("no_speech_thold"),
        whisper_full_params.greedy.layout().withName("greedy"),
        whisper_full_params.beam_search.layout().withName("beam_search"),
        MemoryLayout.paddingLayout(4),
        whisper_h.C_POINTER.withName("new_segment_callback"),
        whisper_h.C_POINTER.withName("new_segment_callback_user_data"),
        whisper_h.C_POINTER.withName("progress_callback"),
        whisper_h.C_POINTER.withName("progress_callback_user_data"),
        whisper_h.C_POINTER.withName("encoder_begin_callback"),
        whisper_h.C_POINTER.withName("encoder_begin_callback_user_data"),
        whisper_h.C_POINTER.withName("abort_callback"),
        whisper_h.C_POINTER.withName("abort_callback_user_data"),
        whisper_h.C_POINTER.withName("logits_filter_callback"),
        whisper_h.C_POINTER.withName("logits_filter_callback_user_data"),
        whisper_h.C_POINTER.withName("grammar_rules"),
        whisper_h.C_LONG.withName("n_grammar_rules"),
        whisper_h.C_LONG.withName("i_start_rule"),
        whisper_h.C_FLOAT.withName("grammar_penalty"),
        whisper_h.C_BOOL.withName("vad"),
        MemoryLayout.paddingLayout(3),
        whisper_h.C_POINTER.withName("vad_model_path"),
        whisper_vad_params.layout().withName("vad_params")
    ).withName("whisper_full_params");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt strategy$LAYOUT = (OfInt)$LAYOUT.select(groupElement("strategy"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum whisper_sampling_strategy strategy
     * }
     */
    public static final OfInt strategy$layout() {
        return strategy$LAYOUT;
    }

    private static final long strategy$OFFSET = $LAYOUT.byteOffset(groupElement("strategy"));

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum whisper_sampling_strategy strategy
     * }
     */
    public static final long strategy$offset() {
        return strategy$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
